&НаКлиенте
Процедура ТоварыТоварОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)	
	ВыбранныйТип  = ТипЗнч(ВыбранноеЗначение);	
	Если ВыбранныйТип = Тип("СправочникСсылка.Товар") Тогда
		ЕдиницаИзмеренияТовара = ВыбранноеЗначение.ЕдиницаИзмерения;		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ТекущиеДанные.ЕдиницаИзмерения = ЕдиницаИзмеренияТовара;
	КонецЕсли;
КонецПроцедуры
