// @strict-types

// Запрос проведения приема на работу.
// 
// Параметры:
//  ИдПриемаНаРаботу - Строка
// 
// Возвращаемое значение:
//  Структура - Запрос проведения приема на работу:
// * ИдПриемаНаРаботу - Строка
Функция ЗапросПроведенияПриемаНаРаботу(ИдПриемаНаРаботу) Экспорт
	Запрос = Новый Структура;
	Запрос.Вставить("ИдПриемаНаРаботу", ИдПриемаНаРаботу);
	Возврат Запрос;
КонецФункции

// Запрос приема на работу.
// 
// Параметры:
//  ИдФизическогоЛица - Строка
//  ИдДолжности - Строка
//  ДатаПриема - Дата
// 
// Возвращаемое значение:
//  Структура - Запрос приема на работу:
// * ИдФизическогоЛица - Строка 
// * ИдДолжности - Строка
// * ДатаПриема - Дата
Функция ЗапросПриемаНаРаботу(ИдФизическогоЛица, ИдДолжности, ДатаПриема) Экспорт
	Запрос = новый Структура;
	Запрос.Вставить("ИдФизическогоЛица", ИдФизическогоЛица);
	Запрос.Вставить("ИдДолжности", ИдДолжности);
	Запрос.Вставить("ДатаПриема", ДатаПриема);
	Возврат Запрос;
КонецФункции

// Запрос увольнения.
// 
// Параметры:
//  ИдДокументаПриема - Строка
//  ИдУвольняемогоСотрудника - Строка
// 
// Возвращаемое значение:
//  Структура - Запрос увольнения:
// * ИдДокумента - Строка
Функция ЗапросУвольнения(ИдДокументаПриема) Экспорт
	Запрос = новый Структура;
	Запрос.Вставить("ИдДокумента", ИдДокументаПриема);	
	Возврат Запрос;
КонецФункции