#Область ТранспортОбъект

// Создать объект транспорта.
// 
// Параметры:
//  Наименование - Строка
//  ПаркСсылка - СправочникСсылка.Парки
// 
// Возвращаемое значение:
//  СправочникОбъект.Транспорт
Функция СоздатьОбъектТранспорта(Наименование, ПаркСсылка) Экспорт
	Транспорт = Справочники.Транспорт.СоздатьЭлемент();
	Транспорт.Код = МодульПримитивовКлиентСервер.СгенерироватьGuid();
	Транспорт.Наименование = Наименование;
	Транспорт.Владелец = ПаркСсылка;
	Транспорт.Статус = Перечисления.СтатусыТранспорта.Свободен;
	Транспорт.КемЗанят = Неопределено;
	Транспорт.ДатаБронирования = Неопределено;
	Транспорт.ДатаОсвобождения = Неопределено;	
	Транспорт.Модель = Наименование;
	Возврат Транспорт;	
КонецФункции

#КонецОбласти