// @strict-types


// Сгенерировать guid.
// 
// Возвращаемое значение:
//  Строка - Guid как строка
Функция СгенерироватьGuid() Экспорт
	Guid = новый УникальныйИдентификатор();
	Идентификатор = Строка(Guid);
	Возврат Идентификатор;
КонецФункции

// Ссылка NULLИли неопределено.
// 
// Параметры:
//  Ссылка - СправочникСсылка Или ДокументСсылка
// 
// Возвращаемое значение:
//  Булево - Ссылка NULL Или неопределено
Функция СсылкаNULLИлиНеопределено(Ссылка) Экспорт
	Возврат Ссылка = NULL или Ссылка = Неопределено;
КонецФункции

// Объект NULLИли неопределено.
// 
// Параметры:
//  Объект - СправочникОбъект Или ДокументОбъект
// 
// Возвращаемое значение:
//  Булево - Объект NULL Или неопределено
Функция ОбъектNULLИлиНеопределено(Объект) Экспорт
	Возврат Объект = NULL или Объект = Неопределено;
КонецФункции