// @strict-types

// Завершить договор аренды.
// 
// Параметры:
//  Команда - КомандаФормы
&НаКлиенте
Процедура ЗавершитьДоговорАренды(Команда)
	НомерДоговора = Объект.Номер;
	Запрос = МодульАрендПарковКлиент.ЗапросРасторгнутьАрендуТранспорта(НомерДоговора);
	Ответ = МодульАрендПарковВызовСервера.РасторгнутьАрендуТранспорта(Запрос);
	ОповеститьОбИзменении(Ответ.АрендованныйПаркСсылка);
	ОповеститьОбИзменении(Ответ.ДокументСсылка);
	МодульФормКлиент.ЗакрытьБезСохранения(ЭтотОбъект);
КонецПроцедуры