
&НаКлиенте
Процедура ТоварыЦенаПродажиПриИзменении(Элемент)
	РассчитатьСпред();
	РассчитатьСуммуТовара();
	РассчитатьСуммуНаОсновеСпреда();
	РассчитатьСуммуДокументаНаОсновеТоваров();
	ОповеститьЕслиСпредОтрицательный();	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПокупкиПриИзменении(Элемент)
	РассчитатьСпред();
	РассчитатьСуммуТовара();
	РассчитатьСуммуНаОсновеСпреда();
	РассчитатьСуммуДокументаНаОсновеТоваров();
	ОповеститьЕслиСпредОтрицательный();	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьЕслиСпредОтрицательный()
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущийСпред = ТекущиеДанные.Спред;
	Если ТекущийСпред < 0 Тогда
		Текст = "Номер строки %1 спред не должен быть отрицательным.";
		Шаблон = СтрШаблон(Текст, ТекущиеДанные.НомерСтроки);
		ПоказатьОповещениеПользователя(Шаблон);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуТовара()
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Спред = ТекущиеДанные.Спред;
	ТекущиеДанные.СуммаТовара = Спред;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСпред()
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЦенаПокупки = ТекущиеДанные.ЦенаПокупки;
	ЦенаПродажи = ТекущиеДанные.ЦенаПродажи;
	Спред = ЦенаПродажи - ЦенаПокупки;
	ТекущиеДанные.Спред = Спред;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуНаОсновеСпреда()
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Спред = ТекущиеДанные.Спред;
	КоличествоТовара = ТекущиеДанные.КоличествоТовара;
	СуммаТовара = Спред;		
	ТекущиеДанные.СуммаТовара = СуммаТовара * КоличествоТовара;	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокументаНаОсновеТоваров()		
	СуммаДокумента = 0;
	СуммаВсехТоваров = Объект.Товары.Итог("СуммаТовара");
	СуммаДокумента = СуммаВсехТоваров;
	Объект.СуммаДокумента = СуммаДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)	
	ВыбранныйТип  = ТипЗнч(ВыбранноеЗначение);	
	Если ВыбранныйТип = Тип("СправочникСсылка.Товар") Тогда
		ЕдиницаИзмеренияТовара = ВыбранноеЗначение.ЕдиницаИзмерения;		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ТекущиеДанные.ЕдиницаИзмерения = ЕдиницаИзмеренияТовара;
	КонецЕсли;
КонецПроцедуры
