// @strict-types

&НаКлиенте
Процедура СоздатьФизическоеЛицо(Команда)
	Фио = Объект.Наименование;
	НомерТелефона = Объект.НомерТелефона;
	Запрос = МодульФизическиеЛицаВызовСервера.ЗапросСозданиеФизическогоЛица(Фио, НомерТелефона);
	Лицо = МодульФизическиеЛицаВызовСервера.СоздатьФизическоеЛицо(Запрос);
	ОповеститьОЗаписиНового(Лицо.ФизическоеЛицо);
	МодульФормКлиент.ЗакрытьБезСохранения(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФизическоеЛицо(Команда)	
	Запрос = МодульФизическиеЛицаВызовСервера.СоздатьЗапросУдалениеФизическогоЛица(Объект.Код);
	Лицо = МодульФизическиеЛицаВызовСервера.УдалитьФизическоеЛицо(Запрос);
	ОповеститьОбИзменении(Лицо.ФизическоеЛицо);
	МодульФормКлиент.ЗакрытьБезСохранения(ЭтотОбъект);
КонецПроцедуры