// @strict-types

// Уволить сотрудника.
// 
// Параметры:
//  Команда - КомандаФормы
&НаКлиенте
Процедура СоздатьПриемНаРаботу(Команда)
	ЗапросПриема = МодульПриемНаРаботуКлиент.ЗапросПриемаНаРаботу(Объект.ФизическоеЛицо.Код, Объект.Должность.Код, Объект.Дата);
	ОтветПриема = МодульПриемНаРаботуВызовСервера.ПринятьНаРаботу(ЗапросПриема);
	ЗапросСозданиеСотрудника = МодульСотрудникиКлиент.ЗапросНаСозданиеСотрудника(ОтветПриема.ПриемНаРаботу.Номер);
	ОтветСотрудника = МодульСотрудникиВызовСервера.ПринятьСотрудникаНаРаботу(ЗапросСозданиеСотрудника);
	ЗапросПроведения = МодульПриемНаРаботуКлиент.ЗапросПроведенияПриемаНаРаботу(ОтветПриема.ПриемНаРаботу.Номер);
	ОтветПроведения = МодульПриемНаРаботуВызовСервера.ПровестиПриемНаРаботу(ЗапросПроведения);
	ОповеститьОбИзменении(ОтветПроведения.ПриемНаРаботу.Ссылка);
	ОповеститьОбИзменении(ОтветСотрудника.Сотрудник);
	МодульФормКлиент.ЗакрытьБезСохранения(ЭтотОбъект);
КонецПроцедуры

// Уволить сотрудника.
// 
// Параметры:
//  Команда - КомандаФормы
&НаКлиенте
Процедура УволитьСотрудника(Команда)
	ЗапросУвольнения = МодульПриемНаРаботуКлиент.ЗапросУвольнения(Объект.Номер);
	ОтветУвольнения = МодульПриемНаРаботуВызовСервера.ПровестиУвольнениеСотрудника(ЗапросУвольнения);
	ОповеститьОбИзменении(Объект.Ссылка);
	ОповеститьОбИзменении(ОтветУвольнения.Сотрудник.Ссылка);
	МодульФормКлиент.ЗакрытьБезСохранения(ЭтотОбъект);
КонецПроцедуры