#Область СоздатьСкладUseCase

// Создать склад.
// 
// Параметры:
//  Запрос - Структура:
//   * Наименование - Строка
// 
// Возвращаемое значение:
//  
Функция СоздатьСклад(Запрос) Экспорт
	ПроверитьДубликатСклада(Запрос.Наименование);
	Склад = СоздатьОбъектСклад(Запрос.Наименование);
	Возврат ОтветСоздатьСклад(Склад);
КонецФункции


// Ответ создать склад.
// 
// Параметры:
//  Склад - СправочникОбъект.Склады
// 
// Возвращаемое значение:
//  Структура - Ответ создать склад:
// * СкладСсылка - СправочникСсылка.Склады
Функция ОтветСоздатьСклад(Склад)
	Ответ = новый Структура;
	Ответ.Вставить("СкладСсылка", Склад.Ссылка);
	Возврат Ответ;
КонецФункции

// Проверить дубликат склада.
// 
// Параметры:
//  Наименование - Строка
Процедура ПроверитьДубликатСклада(Наименование)
	ЗапросВБазу = Новый Запрос;
	ЗапросВБазу.Текст =
	"ВЫБРАТЬ Склады.Наименование КАК Наименование
	|ИЗ Справочник.Склады КАК Склады
	|ГДЕ Склады.Наименование = &Адрес";
	РезультатЗапроса = ЗапросВБазу.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Дубликат = РезультатЗапроса.Наименование;
		Ошибка = СтрШаблон("Дубликат адреса склада - %1.", Дубликат);
		ВызватьИсключение Ошибка;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбъектСклад

// Создать объект склад.
// 
// Параметры:
//  Наименование - Строка
// 
// Возвращаемое значение:
//  СправочникОбъект.Склады
Функция СоздатьОбъектСклад(Наименование)
	Склад = Справочники.Склады.СоздатьЭлемент();
	Склад.Код = МодульПримитивовКлиентСервер.СгенерироватьGuid();
	Склад.Наименование = Наименование;
	Склад.КоличествоТовара = 0;
	Склад.Записать();
КонецФункции

#КонецОбласти