// @strict-types

// Добавить склад.
// 
// Параметры:
//  Команда - КомандаФормы
&НаКлиенте
Процедура ДобавитьСклад(Команда)
	Наименование = Объект.Наименование;
	Адрес = Объект.Адрес;
	Ответ = МодульСкладыКлиент.СоздатьПустойСкладКлиент(Наименование, Адрес);	
	ОповеститьОбИзменении(Ответ.СкладСсылка);
	МодульФормКлиент.ЗакрытьБезСохранения(ЭтотОбъект);
КонецПроцедуры

// Сохранить изменения товаров на складе.
// 
// Параметры:
//  Команда - КомандаФормы
&НаКлиенте
Процедура СохранитьИзмененияТоваровНаСкладе(Команда)
	СсылкаСклада = Объект.Ссылка;
	ТоварыНаСкладе = Объект.ТоварыНаСкладе;
	Ответ = МодульСкладыКлиент.СохранитьТоварыСкладаКлиент(СсылкаСклада, ТоварыНаСкладе);
	ОповеститьОбИзменении(Ответ.СкладСсылка);
КонецПроцедуры