// @strict-types

&НаКлиенте
Процедура ДобавитьДолжность(Команда)
	НазваниеДолжности = Объект.Наименование;		
	Запрос = МодульДолжностейВызовСервера.ЗапросСозданияДолжности(НазваниеДолжности);
	Ответ = МодульДолжностейВызовСервера.СоздатьДолжность(Запрос);				
	ОповеститьОЗаписиНового(Ответ.Должность);		
	МодульФормКлиент.ЗакрытьБезСохранения(ЭтотОбъект);						
КонецПроцедуры

&НаКлиенте 
Процедура УдалитьДолжность(Команда)
	Id = Объект.Код;
	Запрос = МодульДолжностейВызовСервера.ЗапросУдаленияДолжности(Id);	
	Ответ = МодульДолжностейВызовСервера.УдалитьДолжность(Запрос);
	ОповеститьОбИзменении(Ответ.Должность);
	МодульФормКлиент.ЗакрытьБезСохранения(ЭтотОбъект);
КонецПроцедуры

